package bg.tu_varna.sit.a4.f23621661;

/**
 * Интерфейс {@code Command} дефинира метод за изпълнение на команда
 * като част от реализацията на шаблона Command (Команда).
 * Всички класове, които имплементират този интерфейс, трябва да реализират метода {@code execute}.
 */
public interface Command {

    /**
     * Изпълнява логиката на конкретната команда с подадените аргументи.
     *
     * @param args масив от аргументи, използвани при изпълнението на командата
     */
    void execute(String[] args);
}
